; domain
(define (domain snake)
(:requirements :equality :negative-preconditions)
(:constants
    dummypoint
)
(:predicates
    ;up down left right of a field
    (ISADJACENT ?x ?y)
    ;the last field of the snake
    (tailsnake ?x)
    ;the first field of the snake
    (headsnake ?x)
    ;pieces of the snake that are connected. from front to back
    (nextsnake ?x ?y)
    ;a field that is occupied by the snake or by an obstacle
    (blocked ?x)
    ;next point that will spawn
    (spawn ?x)
    ;point y will spawn after point x
    (NEXTSPAWN ?x ?y)
    ;a field that has a point that can be collected by the snake
    (ispoint ?x)
)
(:action move
    :parameters (?head ?newhead ?tail ?newtail)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (tailsnake ?tail)
        (nextsnake ?newtail ?tail)
        (not (blocked ?newhead))
        (not (ispoint ?newhead))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (blocked ?tail))
        (not (tailsnake ?tail))
        (not (nextsnake ?newtail ?tail))
        (tailsnake ?newtail)
    )
)

(:action move-and-eat-spawn
    :parameters (?head ?newhead ?spawnpoint ?nextspawnpoint)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn ?spawnpoint)
        (NEXTSPAWN ?spawnpoint ?nextspawnpoint)
        (not (= ?spawnpoint dummypoint))
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
        (ispoint ?spawnpoint)
        (not (spawn ?spawnpoint))
        (spawn ?nextspawnpoint)
    )
)

(:action move-and-eat-no-spawn
    :parameters (?head ?newhead)
    :precondition
    (and
        (headsnake ?head)
        (ISADJACENT ?head ?newhead)
        (not (blocked ?newhead))
        (ispoint ?newhead)
        (spawn dummypoint)
    )
    :effect
    (and
        (blocked ?newhead)
        (headsnake ?newhead)
        (nextsnake ?newhead ?head)
        (not (headsnake ?head))
        (not (ispoint ?newhead))
    )
)

)

; problem
(define (problem snake-empty-4x6-1-5-2-179)
(:domain snake)
(:objects
    pos0-0 pos0-1 pos0-2 pos0-3 pos0-4 pos0-5 pos1-0 pos1-1 pos1-2 pos1-3 pos1-4 pos1-5 pos2-0 pos2-1 pos2-2 pos2-3 pos2-4 pos2-5 pos3-0 pos3-1 pos3-2 pos3-3 pos3-4 pos3-5
)
(:init
    (isAdjacent pos0-0 pos1-0)
 (isAdjacent pos0-0 pos0-1)
 (isAdjacent pos0-1 pos1-1)
 (isAdjacent pos0-1 pos0-2)
 (isAdjacent pos0-1 pos0-0)
 (isAdjacent pos0-2 pos1-2)
 (isAdjacent pos0-2 pos0-3)
 (isAdjacent pos0-2 pos0-1)
 (isAdjacent pos0-3 pos1-3)
 (isAdjacent pos0-3 pos0-4)
 (isAdjacent pos0-3 pos0-2)
 (isAdjacent pos0-4 pos1-4)
 (isAdjacent pos0-4 pos0-5)
 (isAdjacent pos0-4 pos0-3)
 (isAdjacent pos0-5 pos1-5)
 (isAdjacent pos0-5 pos0-4)
 (isAdjacent pos1-0 pos2-0)
 (isAdjacent pos1-0 pos1-1)
 (isAdjacent pos1-0 pos0-0)
 (isAdjacent pos1-1 pos2-1)
 (isAdjacent pos1-1 pos1-2)
 (isAdjacent pos1-1 pos0-1)
 (isAdjacent pos1-1 pos1-0)
 (isAdjacent pos1-2 pos2-2)
 (isAdjacent pos1-2 pos1-3)
 (isAdjacent pos1-2 pos0-2)
 (isAdjacent pos1-2 pos1-1)
 (isAdjacent pos1-3 pos2-3)
 (isAdjacent pos1-3 pos1-4)
 (isAdjacent pos1-3 pos0-3)
 (isAdjacent pos1-3 pos1-2)
 (isAdjacent pos1-4 pos2-4)
 (isAdjacent pos1-4 pos1-5)
 (isAdjacent pos1-4 pos0-4)
 (isAdjacent pos1-4 pos1-3)
 (isAdjacent pos1-5 pos2-5)
 (isAdjacent pos1-5 pos0-5)
 (isAdjacent pos1-5 pos1-4)
 (isAdjacent pos2-0 pos3-0)
 (isAdjacent pos2-0 pos2-1)
 (isAdjacent pos2-0 pos1-0)
 (isAdjacent pos2-1 pos3-1)
 (isAdjacent pos2-1 pos2-2)
 (isAdjacent pos2-1 pos1-1)
 (isAdjacent pos2-1 pos2-0)
 (isAdjacent pos2-2 pos3-2)
 (isAdjacent pos2-2 pos2-3)
 (isAdjacent pos2-2 pos1-2)
 (isAdjacent pos2-2 pos2-1)
 (isAdjacent pos2-3 pos3-3)
 (isAdjacent pos2-3 pos2-4)
 (isAdjacent pos2-3 pos1-3)
 (isAdjacent pos2-3 pos2-2)
 (isAdjacent pos2-4 pos3-4)
 (isAdjacent pos2-4 pos2-5)
 (isAdjacent pos2-4 pos1-4)
 (isAdjacent pos2-4 pos2-3)
 (isAdjacent pos2-5 pos3-5)
 (isAdjacent pos2-5 pos1-5)
 (isAdjacent pos2-5 pos2-4)
 (isAdjacent pos3-0 pos3-1)
 (isAdjacent pos3-0 pos2-0)
 (isAdjacent pos3-1 pos3-2)
 (isAdjacent pos3-1 pos2-1)
 (isAdjacent pos3-1 pos3-0)
 (isAdjacent pos3-2 pos3-3)
 (isAdjacent pos3-2 pos2-2)
 (isAdjacent pos3-2 pos3-1)
 (isAdjacent pos3-3 pos3-4)
 (isAdjacent pos3-3 pos2-3)
 (isAdjacent pos3-3 pos3-2)
 (isAdjacent pos3-4 pos3-5)
 (isAdjacent pos3-4 pos2-4)
 (isAdjacent pos3-4 pos3-3)
 (isAdjacent pos3-5 pos2-5)
 (isAdjacent pos3-5 pos3-4)
    (tailSnake pos0-1)
    (headSnake pos0-0)
    (nextSnake pos0-0 pos0-1)
    (blocked pos0-0)
 (blocked pos0-1)
    (spawn pos1-4)
 (nextSpawn pos2-4 dummyPoint)
 (nextSpawn pos1-4 pos2-4)
    (isPoint pos3-0)
 (isPoint pos2-3)
 (isPoint pos3-5)
 (isPoint pos1-1)
 (isPoint pos1-2)
)
(:goal (and
    (not (isPoint pos3-0))
 (not (isPoint pos2-3))
 (not (isPoint pos3-5))
 (not (isPoint pos1-1))
 (not (isPoint pos1-2))
 (not (isPoint pos1-4))
 (not (isPoint pos2-4))
))
)

; plan
1. (move pos0-0 pos1-0 pos0-1 pos0-0)
   deleted: (headsnake pos0-0) (blocked pos0-1) (tailsnake pos0-1) (nextsnake pos0-0 pos0-1)
   added: (blocked pos1-0) (headsnake pos1-0) (nextsnake pos1-0 pos0-0) (tailsnake pos0-0)
   goals met: 2 of 7
2. (move pos1-0 pos2-0 pos0-0 pos1-0)
   deleted: (headsnake pos1-0) (blocked pos0-0) (tailsnake pos0-0) (nextsnake pos1-0 pos0-0)
   added: (blocked pos2-0) (headsnake pos2-0) (nextsnake pos2-0 pos1-0) (tailsnake pos1-0)
   goals met: 2 of 7
3. (move-and-eat-spawn pos2-0 pos3-0 pos1-4 pos2-4)
   deleted: (headsnake pos2-0) (ispoint pos3-0) (spawn pos1-4)
   added: (blocked pos3-0) (headsnake pos3-0) (nextsnake pos3-0 pos2-0) (ispoint pos1-4) (spawn pos2-4)
   goals met: 2 of 7
4. (move pos3-0 pos3-1 pos1-0 pos2-0)
   deleted: (headsnake pos3-0) (blocked pos1-0) (tailsnake pos1-0) (nextsnake pos2-0 pos1-0)
   added: (blocked pos3-1) (headsnake pos3-1) (nextsnake pos3-1 pos3-0) (tailsnake pos2-0)
   goals met: 2 of 7
5. (move pos3-1 pos2-1 pos2-0 pos3-0)
   deleted: (headsnake pos3-1) (blocked pos2-0) (tailsnake pos2-0) (nextsnake pos3-0 pos2-0)
   added: (blocked pos2-1) (headsnake pos2-1) (nextsnake pos2-1 pos3-1) (tailsnake pos3-0)
   goals met: 2 of 7
6. (move-and-eat-spawn pos2-1 pos1-1 pos2-4 dummypoint)
   deleted: (headsnake pos2-1) (ispoint pos1-1) (spawn pos2-4)
   added: (blocked pos1-1) (headsnake pos1-1) (nextsnake pos1-1 pos2-1) (ispoint pos2-4) (spawn dummypoint)
   goals met: 2 of 7
7. (move-and-eat-no-spawn pos1-1 pos1-2)
   deleted: (headsnake pos1-1) (ispoint pos1-2)
   added: (blocked pos1-2) (headsnake pos1-2) (nextsnake pos1-2 pos1-1)
   goals met: 3 of 7
8. (move pos1-2 pos1-3 pos3-0 pos3-1)
   deleted: (headsnake pos1-2) (blocked pos3-0) (tailsnake pos3-0) (nextsnake pos3-1 pos3-0)
   added: (blocked pos1-3) (headsnake pos1-3) (nextsnake pos1-3 pos1-2) (tailsnake pos3-1)
   goals met: 3 of 7
9. (move-and-eat-no-spawn pos1-3 pos2-3)
   deleted: (headsnake pos1-3) (ispoint pos2-3)
   added: (blocked pos2-3) (headsnake pos2-3) (nextsnake pos2-3 pos1-3)
   goals met: 4 of 7
10. (move-and-eat-no-spawn pos2-3 pos2-4)
   deleted: (headsnake pos2-3) (ispoint pos2-4)
   added: (blocked pos2-4) (headsnake pos2-4) (nextsnake pos2-4 pos2-3)
   goals met: 5 of 7
11. (move-and-eat-no-spawn pos2-4 pos1-4)
   deleted: (headsnake pos2-4) (ispoint pos1-4)
   added: (blocked pos1-4) (headsnake pos1-4) (nextsnake pos1-4 pos2-4)
   goals met: 6 of 7
12. (move pos1-4 pos1-5 pos3-1 pos2-1)
   deleted: (headsnake pos1-4) (blocked pos3-1) (tailsnake pos3-1) (nextsnake pos2-1 pos3-1)
   added: (blocked pos1-5) (headsnake pos1-5) (nextsnake pos1-5 pos1-4) (tailsnake pos2-1)
   goals met: 6 of 7
13. (move pos1-5 pos2-5 pos2-1 pos1-1)
   deleted: (headsnake pos1-5) (blocked pos2-1) (tailsnake pos2-1) (nextsnake pos1-1 pos2-1)
   added: (blocked pos2-5) (headsnake pos2-5) (nextsnake pos2-5 pos1-5) (tailsnake pos1-1)
   goals met: 6 of 7
14. (move-and-eat-no-spawn pos2-5 pos3-5)
   deleted: (headsnake pos2-5) (ispoint pos3-5)
   added: (blocked pos3-5) (headsnake pos3-5) (nextsnake pos3-5 pos2-5)
   goals met: 7 of 7
